Show / Hide Table of Contents
Class CheckSection
Check section base class
Inheritance
System.Object
OpenObject
OpenElementId
CheckSection
StagedCheckSection
StandardCheckSection
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete
Assembly: IdeaRS.OpenModel.dll
Syntax
public abstract class CheckSection : OpenElementId
Constructors
Improve this Doc   View Source
CheckSection()
Constructor
Declaration
protected CheckSection()
Properties
Improve this Doc   View Source
Description
Description of this section
Declaration
public string Description { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Extremes
Section extremes
Declaration
public List<CheckSectionExtreme> Extremes { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<CheckSectionExtreme>
Improve this Doc   View Source
CheckMember
CheckMember
Declaration
public ReferenceElement CheckMember { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
ReinfSection
Reinforcement of cross-section
Declaration
public ReferenceElement ReinfSection { get; set; }
Property Value
 Type |  Description
 ReferenceElement
 Improve this Doc
 View Source